student_1 = ['Смирнов', 'Азиз', 'Анатольевич', 2000, 3, 'ИНФ-1001', [5, 4,5, 4, 4]]
student_2 = {'Соколов', 'Вадим', 'Игнатьевич', 2000, 3, 'ИНФ-1002', [4, 5, 3, 2,2]}
student_3 = ['Федоров', 'Глеб', 'Иосифович', 1999, 4, 'ИНФ-1003', [5, 4, 5, 4, 4]]
student_4 = ['Киселев', 'Дамир', 'Валентинович', 1999, 4, 'ИНФ-1004', [4, 5, 3, 2,2]]
if student_1[5] == 3:
    print('student_1 а 3 курсе')
if student_2[5] == 3:
    print('student_2 а 3 курсе')
if student_3[5] == 4:
    print('student_3 а 4 курсе')
if student_4[5] == 4:
    print('student_4 а 4 курсе')
sum_1 = (5 + 4 + 5 + 4 + 4) / 5
sum_2 = (4 + 5 + 3 + 2 + 2) / 5
sum_3 = (5 + 4 + 5 + 4 + 4) / 5
sum_4 = (4 + 5 + 3 + 2 + 2) / 5
print(sum_1)
print(sum_2)
print(sum_3)
print(sum_4)
if sum_1  > sum_2:
    print('Смирнов', 'Азиз', 'Анатольевич', 'лучший ученик в 3 курсе')
elif sum_1 < sum_2:
    print('Соколов', 'Вадим', 'Игнатьевич', 'лучший ученик в 3 курсе')
if sum_3 > sum_4:
    print('Федоров', 'Глеб', 'Иосифович', 'лучший ученик в 4 курсе')
elif sum_3 < sum_4:
    print('Киселев', 'Дамир', 'Валентинович', 'лучший ученик в 4 курсе')